---
type: ElementMulticategoryFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementMulticategoryFilter

`Autodesk.Revit.DB.ElementMulticategoryFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementMulticategoryFilter | — | `` |
| Method | GetCategoryIds | 2012 | `public ICollection < ElementId > GetCategoryIds ()` |
| Method | PassesFilter | — | `` |